Catalogs/ШаблоныПередачиЛицензий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ШаблоныПередачиЛицензий</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШаблонХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ШаблоныПередачиЛицензий/Forms/ФормаРедактированияШаблона/Ext/Form/Module.bsl
// Форма редактирования шаблона акта передачи лицензий.
// Принцип повторяет типовую форму Справочник.ШаблоныДоговоров.ФормаРедактированияШаблона:
// центральное поле форматированного документа + команды вставки параметров
// (выделяются полужирным шрифтом на желтом фоне).

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.ВосстановитьТиповойШаблон.Видимость = ЗначениеЗаполнено(Объект.ИмяМакета);

	ДанныеШаблона = Неопределено;

	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		// Открытие существующего шаблона.
		ДанныеШаблона = Справочники.ШаблоныПередачиЛицензий.ДанныеШаблона(Объект.Ссылка);
	ИначеЕсли Параметры.Свойство("ЗначениеКопирования")
		И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		// Копирование существующего шаблона.
		ДанныеШаблона = Справочники.ШаблоныПередачиЛицензий.ДанныеШаблона(Параметры.ЗначениеКопирования);
	КонецЕсли;

	Если ДанныеШаблона <> Неопределено И Не ПустаяСтрока(ДанныеШаблона.ТекстHTML) Тогда
		ФорматированныйДокумент.УстановитьHTML(ДанныеШаблона.ТекстHTML, ДанныеШаблона.Вложения);
	ИначеЕсли ЗначениеЗаполнено(Объект.ИмяМакета) Тогда
		// Создание нового шаблона на основании типового макета.
		МакетАкта = Справочники.ШаблоныПередачиЛицензий.ПолучитьМакет(Объект.ИмяМакета);
		ФорматированныйДокумент.УстановитьHTML(МакетАкта.ПолучитьТекст(), Новый Структура);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект)

	ТекстHTML = "";
	Вложения = Неопределено;
	ФорматированныйДокумент.ПолучитьHTML(ТекстHTML, Вложения);
	Если Вложения = Неопределено Тогда
		Вложения = Новый Структура;
	КонецЕсли;

	ДанныеШаблона = Новый Структура("ТекстHTML, Вложения", ТекстHTML, Вложения);
	ТекущийОбъект.ШаблонХранилище = Новый ХранилищеЗначения(ДанныеШаблона, Новый СжатиеДанных(9));

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВставитьПараметрОбработчик(Команда)

	// Имя команды вида "ВставитьПараметр" + ИмяПараметра.
	ИмяПараметра = Сред(Команда.Имя, СтрДлина("ВставитьПараметр") + 1);
	ВставитьПараметр("{" + ИмяПараметра + "}");

КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьТиповойШаблон(Команда)

	ТекстВопроса = НСтр("ru = 'Заменить текущий текст шаблона текстом типового макета?'");
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ВосстановитьТиповойШаблонЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);

КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьТиповойШаблонЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	ВосстановитьТиповойШаблонНаСервере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВосстановитьТиповойШаблонНаСервере()

	Если Не ЗначениеЗаполнено(Объект.ИмяМакета) Тогда
		Возврат;
	КонецЕсли;

	МакетАкта = Справочники.ШаблоныПередачиЛицензий.ПолучитьМакет(Объект.ИмяМакета);
	ФорматированныйДокумент.УстановитьHTML(МакетАкта.ПолучитьТекст(), Новый Структура);
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ВставитьПараметр(Значение)

	ЗакладкаНачала = Неопределено;
	ЗакладкаОкончания = Неопределено;
	Элементы.ФорматированныйДокумент.ПолучитьГраницыВыделения(ЗакладкаНачала, ЗакладкаОкончания);

	Если ЗакладкаНачала <> ЗакладкаОкончания Тогда
		ФорматированныйДокумент.Удалить(ЗакладкаНачала, ЗакладкаОкончания);
		Элементы.ФорматированныйДокумент.УстановитьГраницыВыделения(ЗакладкаНачала, ЗакладкаНачала);
	КонецЕсли;

	// Выделяем параметр полужирным шрифтом и желтым фоном.
	Если ФорматированныйДокумент.Элементы.Количество() = 0 Тогда
		НовыйЭлементДокумента = ФорматированныйДокумент.Добавить(Значение, Тип("ТекстФорматированногоДокумента"));
	Иначе
		НовыйЭлементДокумента = ФорматированныйДокумент.Вставить(ЗакладкаНачала, Значение, Тип("ТекстФорматированногоДокумента"));
	КонецЕсли;

	НовыйЭлементДокумента.Шрифт = Новый Шрифт(НовыйЭлементДокумента.Шрифт, , , Истина, , );
	НовыйЭлементДокумента.ЦветФона = Новый Цвет(255, 236, 139);

	Модифицированность = Истина;

КонецПроцедуры

#КонецОбласти
